package com.example.gu.four_ten.entity;

import java.util.List;

/**
 * Created by 31452 on 2016/6/29.
 */
public class ImageIdEntity {

    /**
     * result : [{"id":10551,"type":1,"publishtime":636027552000000000,"title":"《黑暗中的舞者》一出没有恶人的悲剧","summary":"今晚的这部触到了美国底部的虚伪，《时代》周刊将它评为2000年度最差电影。\r\n\r\n而这部电影却是丹麦拍出来的，丹麦这个国家在电影上的成就不言而喻，太多高分片都是出自这个国家，这部电影喜欢的人很喜欢，不喜欢的人骂声一片，属于两极分化的电影。\r\n\r\n六万多人的综合评分是8.3分。","image":"images/BC39D99900D7DD50A342AB54441F1D92.jpg"},{"id":10550,"type":1,"publishtime":636026688000000000,"title":"《血色将至 》把魔鬼献给未来","summary":"看的时候总是想，为什么这么暗这么沉啊。画面很多时候黑得只看见丹尼尔的半张脸\u2014\u2014而这时候我就情不自禁赞叹：真是演什么像什么啊。片中的丹尼尔饰演的油矿主，孤独自由，凭强烈的直觉生活，心狠手辣，极富攻击性，从不宽恕。\r\n\r\n镜头表现亦直接而不加修饰。那么粗糙的生命，那么粗糙的生活。人性就在其间磨砺，日益坚硬黑暗，看不出原来模样。片里很难得有二三柔软浅淡处，嵌在整片漆黑黯淡里，叫人分外流连。","image":"images/F9D0643C1D923BF551AA4F2EE44A7E52.jpg"},{"id":10549,"type":1,"publishtime":636025824000000000,"title":"《美国情人》身份的焦虑","summary":"你们有没有这种感觉，在你开车旅行时，永远都到达不了目的地，也希望永远不结束？\r\n\r\n今晚推荐的影片你需要细细观看。","image":"images/628D3CCF2E36FC2DD6144B955C4C297F.jpg"},{"id":10548,"type":1,"publishtime":636024960000000000,"title":"《树大招风》冷风吹不走我梦","summary":"三位新导演令人惊喜地继承了银河精髓，任贤齐追车和陈小春接电话都是神来之笔。97分钟荒诞与悲凉的交织，最难得的地方是一点怨气都没有，它只是悲哀。宿命悲剧的悲，哀莫大于心死的哀，最后的回归看得人简直要哭出来。香港的整个命运都在这部电影里。银河真是香港电影之光。而香港之光又在哪里？","image":"images/F2273EA09ECB285D55C263BD4A617D9A.jpg"},{"id":10547,"type":1,"publishtime":636024096000000000,"title":"《孤儿怨》人人内心，都是孤儿","summary":"周五的晚上推荐一部惊奇的电影，这部电影结局最你意外、震撼，一部2009年的电影《孤儿怨》。豆瓣评分8.1分，截止今晚还没有免费收看链接，所以只能免费观看十分钟，点击文章最后的阅读原文试看一下。\r\n\r\n《孤儿怨》是由华纳兄弟电影公司出品的一部惊悚恐怖片，影片由佐米·希尔拉执导。\r\n\r\n不得不承认，希尔拉是一个很用心的导演，他不但善于使用细节来渲染恐怖的氛围，更善于使用细节来诱发人们的反思，当凯特的儿子丹尼尔在自己的聋哑妹妹麦克斯面前肆无忌惮的玩着高分贝的乐器时，麦克斯一闪而过的那寂静的眼神不但让人心生怜爱，更会引发我们的反思：我们，是不是也是一个孤儿？\r\n\r\n看完影片尤其是后半部越来越意外和惊喜，也引起咖啡兄的内心独白，就如今天的影评标题，人人内心都是孤儿。","image":"images/EBF6F57708DDF2ADCB359C237445F9E2.jpg"},{"id":10546,"type":1,"publishtime":636023232000000000,"title":"《横道世之介 》与君相逢，何其有幸","summary":"今晚推荐一部小镇青年与富家女的爱情影片，这个青年就是横道世之介，影评的名字就是男主的名字，第一次看到这影片名字如果不了解日本文化会不懂，当然我自己都么懂，心想这什么破名字，当知道是人名后觉得还好了，就好比中国的电影《周恩来》、美国的《林肯》等等，这么想就接受了，唯一不同的是名人和普通人区别。\r\n\r\n该片可以说一部洗涤心灵的电影，也是一部感伤动人的电影。明快朴素的调调讲了一个真挚无邪的悲伤故事，两小时四十分钟几次内牛满面，这才是日式致青春。\r\n\r\n日式爱情片并没有经典好莱坞模式的高潮，也没有韩剧的浪漫和曲折。强烈的生活气息是最大的特色，演员的表演相当出彩自然，就好像你从身边随时都能拎出一个相差无几的普通人，完全的本色表演，而也是因为这股真实，连世之介边吃泡面边看书，最后用筷子去翻书页的场景也能惹得观众哄堂大笑.","image":"images/3E4A463122C1DE0DE81BAAF6F1F25E56.jpg"},{"id":10343,"type":1,"publishtime":636022368000000000,"title":"《借东西的小人阿莉埃蒂》借走的糖，还回的心","summary":"今晚推荐一部动画片，说到动画片咖啡兄推荐的不是很多，是偶尔，只是偶尔会推荐一些，这与本人观影爱好有关，推荐的动画片也都是大家耳熟能详的影评，日本的占据很多，尤其是宫崎骏的动画。\r\n\r\n而今天的电影也与宫崎骏有关，他是编剧，这一次不是导演，把导演交给了米林宏昌，也任职于吉卜力工作室，似乎是工作室有意培养后备，毕竟宫崎骏年事已高，需要后来者撑起这个行业。\r\n\r\n《借东西的小人阿莉埃蒂》是根据英国作家玛丽·诺顿的原著《借东西的小人》改编，并荣获2011年日本电影学院奖最佳动画片奖。记忆中日本动画片改编英国原著的不多，今晚这部是很优秀的一部。","image":"images/478138A5885D5FD1678A92F8E93BA1D3.jpg"},{"id":10545,"type":1,"publishtime":636021504000000000,"title":"《成长教育》生活没有捷径","summary":"\"如果在年轻的时候，你还不清楚自己要什么，那么就请去好好的读书\u201d我想在靠着自己的本事供养的温馨的小屋欣赏唯美主义时期的画作，远比在挤满了世故自以为是的富人的拍卖行拍得这些名画，更加有意义。\r\n\r\n今晚推荐一部关于成长的电影《成长教育》影片描写一位16岁女孩面对成长经验、家庭期许，以及突如其来的迷人爱情介入下，从女孩转变成女人的心境历程。\r\n\r\n该片于2009年10月30日在英国上映。","image":"images/961C1C1158A9803DF423B1ECF8AF2B79.jpg"},{"id":10544,"type":1,"publishtime":636020640000000000,"title":"《美食总动员》皮克斯情怀","summary":"今晚推荐一部动画片，也是美食片《美食总动员》。这事是2007年一部由皮克斯动画制作室制作、华特迪士尼影片出版的电影。这部电影另一名字叫《料理鼠王》因为主演是一只老鼠。\r\n\r\n截至2007年10月末，影片的北美票房已经超过2亿美元，全球票房超过10亿美元。\r\n\r\n故事讲述一只原本注定在垃圾堆度过平淡一生的小老鼠小米，梦想成为站在世界之巅的美味大厨。一次偶然机会，瑞米来到了厨神餐厅，认识了资质平平却认真的学徒林奎尼，瑞米帮助他做出一道又一道精美大餐。最后他烹制出全巴黎最棒的普罗旺斯焖菜，成就了一个厨房神话。\r\n\r\n《美食总动员》打破人们的惯性思维，把老鼠小米作为影片的核心人物，期盼结束捡垃圾为食的生活，可以成为巴黎顶级餐厅的主厨，亲手作出最可口的菜肴。在它难于进入五星级酒店的厨房时，新来的清洁工小宽帮了大忙，无家可归的小宽急于保住自己在酒店的工作，而笨手笨脚的他根本就不会做饭。他们彼此的优势都可以帮助到对方，所以世界上最不可能的友谊就诞生了。影片表达了一个放任四海皆准的道理：重视友谊，保持忠诚","image":"images/B0C09AECFB53941289D1707D760BA9CB.jpg"},{"id":10543,"type":1,"publishtime":636019776000000000,"title":"《阿郎的故事》一切感人故事,皆是情语","summary":"今天是父亲节，没有回家只给老爸打了电话简单问候了一下，随着年龄的增长，越发觉得父母需要我们在身边。所以今天的电影与父爱有关，也是前年父亲节咖啡兄推荐的电影，今晚再次推荐，而影评也是十几年前的影评，现在看依然情真字切，所以说文字永不过时。这部父爱深深的片子电就是周润发主演的《阿郎的故事》。\r\n\r\n这是杜琪峰早期最为成功的一部电影，虽然看杜琪峰的警匪 悬疑 动作片更多，但这部电影无疑在当年最为丰收。\r\n\r\n周润发峥嵘岁月里的巅峰力作，一代人永难磨灭的一段记忆!《阿郎的故事》不仅成就了周润发在金像奖红地毯上的又一次辉煌，同时也铸就了罗大佑《你的样子》这样一首永远被镌刻于你我心中的\u201c父爱之歌\u201d!  想听这首歌的也请点击第三篇文章。　　\r\n\r\n当阿郎风驰电掣般冲过终点的那一霎那，我们不得不为之动容，咖啡兄也又一次被银幕这上感人至深的场景所深深的打动!面对儿子，他用余生的努力给他幸福；作为父亲，阿郎将爱与梦想注入进了儿子的血液。而我们唯有定睛凝视去感悟、去尊重这份世间最为博大的情怀!   \r\n\r\n当片尾响起当罗大佑那首《你的样子》，在那略带沙哑的悲怆的歌声响起之后，周润发饰演的阿郎便倒在了血泊之中。赛道外的张艾嘉和那孩子在哭喊着，他们带着对幸福的无限期待，面对着突出其来的悲伤......我的泪不自觉的便从泪腺中溢了出来，为什么一个回头的浪子(一个女人的情人和一个孩子的父亲)会有如此的结局？","image":"images/FEF110CDDE76C01843D23466F6732E93.jpg"}]
     * status : 0
     * errMsg : null
     */

    private int status;
    private Object errMsg;
    /**
     * id : 10551
     * type : 1
     * publishtime : 636027552000000000
     * title : 《黑暗中的舞者》一出没有恶人的悲剧
     * summary : 今晚的这部触到了美国底部的虚伪，《时代》周刊将它评为2000年度最差电影。

     而这部电影却是丹麦拍出来的，丹麦这个国家在电影上的成就不言而喻，太多高分片都是出自这个国家，这部电影喜欢的人很喜欢，不喜欢的人骂声一片，属于两极分化的电影。

     六万多人的综合评分是8.3分。
     * image : images/BC39D99900D7DD50A342AB54441F1D92.jpg
     */

    private List<ResultBean> result;

    public int getStatus() {
        return status;
    }

    public void setStatus(int status) {
        this.status = status;
    }

    public Object getErrMsg() {
        return errMsg;
    }

    public void setErrMsg(Object errMsg) {
        this.errMsg = errMsg;
    }

    public List<ResultBean> getResult() {
        return result;
    }

    public void setResult(List<ResultBean> result) {
        this.result = result;
    }

    public static class ResultBean {
        private int id;
        private int type;
        private long publishtime;
        private String title;
        private String summary;
        private String image;

        public int getId() {
            return id;
        }

        public void setId(int id) {
            this.id = id;
        }

        public int getType() {
            return type;
        }

        public void setType(int type) {
            this.type = type;
        }

        public long getPublishtime() {
            return publishtime;
        }

        public void setPublishtime(long publishtime) {
            this.publishtime = publishtime;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getSummary() {
            return summary;
        }

        public void setSummary(String summary) {
            this.summary = summary;
        }

        public String getImage() {
            return image;
        }

        public void setImage(String image) {
            this.image = image;
        }
    }
}
